{
  "shows": [
    {
      "id": 23455,
      "name": "Game of Thrones",
      "permalink": "game-of-thrones",
      "start_date": "2011-04-17",
      "description": "Nine noble families fight for control of the mythical land of Westeros. Political and sexual intrigue is pervasive. Robert Baratheon, King of Westeros, asks his old friend Eddard, Lord Stark, to serve as Hand of the King, or highest official. Secretly warned that the previous Hand was assassinated, Eddard accepts in order to investigate further. Meanwhile the Queen's family, the Lannisters, may be hatching a plot to take power. Across the sea, the last members of the previous and deposed ruling family, the Targaryens, are also scheming to regain the throne. The friction between the houses Stark, Lannister, Baratheon and Targaryen and with the remaining great houses Greyjoy, Tully, Arryn,Tyrell and Martell leads to full-scale war. All while a very ancient evil awakens in the farthest north. Amidst the war and political confusion, a neglected military order of misfits, the Night's Watch, is all that stands between the realms of men and icy horrors beyond.",
      "end_date": null,
      "genre": "drama",
      "country": "US",
      "network": "HBO",
      "status": "Ended",
      "upvotes": 0,
      "downvotes": 0,
      "image_thumbnail_path": "https://static.episodate.com/images/tv-show/thumbnail/23455.jpg"
    },
    {
      "id": 3564,
      "name": "Friends",
      "permalink": "friends",
      "description": "Six young (20-something) people from New York City (Manhattan), on their own and struggling to survive in the real world, find the companionship, comfort and support they get from each other to be the perfect antidote to the pressures of life.This average group of buddies goes through massive mayhem, family trouble, past and future romances, fights, laughs, tears and surprises as they learn what it really means to be a friend.",
      "description_source": null,
      "start_date": "1994-09-22",
      "end_date": null,
      "country": "US",
      "status": "Ended",
      "runtime": 30,
      "network": "NBC",
      "youtube_link": "ggZkZK-9Pm4",
      "image_path": "https://static.episodate.com/images/tv-show/full/3564.jpg",
      "image_thumbnail_path": "https://static.episodate.com/images/tv-show/thumbnail/3564.jpg",
      "rating": "9.1200",
      "rating_count": "75",
      "countdown": null
    },
    {
      "id": 29560,
      "name": "Arrow",
      "permalink": "arrow",
      "description": "Arrow is an American television series developed by writer/producers Greg Berlanti, Marc Guggenheim, and Andrew Kreisberg. It is based on the DC Comics character Green Arrow, a costumed crime-fighter created by Mort Weisinger and George Papp. It premiered in North America on The CW on October 10, 2012, with international broadcasting taking place in late 2012. Primarily filmed in Vancouver, British Columbia, Canada, the series follows billionaire playboy Oliver Queen, portrayed by Stephen Amell, who, five years after being stranded on a hostile island, returns home to fight crime and corruption as a secret vigilante whose weapon of choice is a bow and arrow. Unlike in the comic books, Queen does not go by the alias \"Green Arrow\". The series takes a realistic look at the Green Arrow character, as well as other characters from the DC Comics universe. Although Oliver Queen/Green Arrow had been featured in the television series Smallville from 2006 to 2011, the producers decided to start clean and find a new actor (Amell) to portray the character. Arrow focuses on the humanity of Oliver Queen, and how he was changed by time spent shipwrecked on an island. Most episodes have flashback scenes to the five years in which Oliver was missing.",
      "start_date": "2012-10-10",
      "end_date": null,
      "genre": "adventure",
      "country": "US",
      "network": "The CW",
      "status": "Ended",
      "upvotes": 0,
      "downvotes": 0,
      "image_thumbnail_path": "https://static.episodate.com/images/tv-show/thumbnail/29560.jpg"
    },
    {
      "id": 43467,
      "name": "Lucifer",
      "permalink": "lucifer",
      "description": "The Devil has come to Los Angeles…Based upon the characters created by Neil Gaiman, Sam Kieth and Mike Dringenberg for DC Entertainment's Vertigo imprint, <b>Lucifer</b> is the story of the original fallen angel. Bored and unhappy as the Lord of Hell, Lucifer Morningstar has abandoned his throne and retired to L.A., where he owns Lux, an upscale nightclub.Charming, charismatic and devilishly handsome, Lucifer is enjoying his retirement, indulging in a few of his favorite things--wine, women and song-–when a beautiful pop star is brutally murdered outside of Lux. For the first time in roughly 10 billion years, he feels something awaken deep within him as a result of this murder. Compassion? Sympathy? The very thought disturbs him--as well as his best friend and confidante, Mazkeen aka Maze, a fierce demon in the form of a beautiful young woman.",
      "start_date": "2016-01-25",
      "end_date": null,
      "genre": "drama",
      "country": "US",
      "network": "Netflix",
      "status": "Running",
      "upvotes": 0,
      "downvotes": 0,
      "image_thumbnail_path": "https://static.episodate.com/images/tv-show/thumbnail/43467.com"
    },
    {
      "id": 43234,
      "name": "Supergirl",
      "permalink": "supergirl",
      "description": "Supergirl is an upcoming American television series developed by writer/producers Greg Berlanti, Ali Adler and Andrew Kreisberg set to air on CBS. It is based on the DC Comics character Supergirl (Kara Zor-El), created by Otto Binder and Al Plastino. Supergirl is a costumed superhero who is the biological cousin to Superman and one of the last surviving Kryptonians. The series was officially picked up on May 6, 2015 after receiving a series commitment in September 2014, and will debut in November 2015.<br><br>Twenty-four-year-old Kara Zor-El, who was taken in by the Danvers family when she was 12 after being sent away from Krypton, must learn to embrace her powers after previously hiding them. The Danvers teach her to be careful with her powers, until she has to reveal them during an unexpected disaster, setting her on her journey of heroism.\r\n<br><br>\r\nThe costume for Supergirl was created by Colleen Atwood, who also designed the costumes for Arrow and The Flash. Benoist stated that she is aware of the costume worn by Kara in the comics books, and expressed that the \"micro-mini hemline\" of the skirt could be \"a little daunting but that's good. I like being pushed.\"Promotional photos of Benoist wearing Atwood's design were released on March 6, 2015. Atwood indicated that she wanted to \"embrace the past  but more importantly, thrust her into the street-style action hero of today.\"",
      "start_date": "2015-10-26",
      "end_date": null,
      "genre": "adventure",
      "country": "US",
      "network": "The CW",
      "status": "Running",
      "upvotes": 0,
      "downvotes": 0,
      "image_thumbnail_path": "https://static.episodate.com/images/tv-show/thumbnail/43234.jpg"
    },
    {
      "id": 46692,
      "name": "DC's Legends of Tomorrow",
      "permalink": "dcs-legends-of-tomorrow",
      "description": "When heroes alone are not enough... the world needs legends. Having seen the future, one he will desperately try to prevent from happening, time-traveling rogue Rip Hunter is tasked with assembling a disparate group of both heroes and villains to confront an unstoppable threat - one in which not only is the planet at stake, but all of time itself. Can this ragtag team defeat an immortal threat unlike anything they have ever known?",
      "start_date": "2016-01-21",
      "end_date": null,
      "genre": "adventure",
      "country": "US",
      "network": "The CW",
      "status": "Running",
      "image_thumbnail_path": "https://static.episodate.com/images/tv-show/thumbnail/46692.jpg"
    },
    {
      "id": 24010,
      "name": "The Walking Dead",
      "permalink": "the-walking-dead",
      "description": "Rick Grimes is a former Sheriff's deputy who has been in a coma for several months after being shot while on duty. When he wakes, he discovers that the world has been taken over by zombies, and that he seems to be the only person still alive. After returning home to discover his wife and son missing, he heads for Atlanta to search for his family. Narrowly escaping death at the hands of the zombies on arrival in Atlanta, he is aided by another survivor,Glenn,who takes Rick to a camp outside the town. There,Rick finds his wife Lori and his son,Carl, along with his partner/best friend Shane and a small group of survivors who struggle to fend off the zombie hordes; as well as competing with other survivor groups who are prepared to do whatever it takes to survive.<br><br>The Walking Dead is an American horror drama television series developed by Frank Darabont. It is based on the comic book series of the same name by Robert Kirkman, Tony Moore, and Charlie Adlard. Andrew Lincoln stars as sheriff's deputy Rick Grimes, who awakens from a coma to find an apocalyptic world dominated by flesh-eating zombies, called \"walkers\". He sets out to find his family and encounters many other survivors along the way.",
      "start_date": "2010-10-31",
      "end_date": null,
      "genre": "adventure",
      "country": "US",
      "network": "AMC",
      "status": "Running",
      "image_thumbnail_path": "https://static.episodate.com/images/tv-show/thumbnail/24010.jpg"
    },
    {
      "id": 47145,
      "name": "Dragon Ball Super",
      "permalink": "dragon-ball-super",
      "description": "<b>Dragon Ball Super</b>, a brand new television anime inspired by Akira Toriyama's Dragon Ball manga, will premiere on Fuji TV and other channels in July on Sundays at 9:00 a.m. This will be the first new Dragon Ball television series since Dragon Ball GT, which aired from 1996 to 1997.The story of the anime is set a few years after the defeat of Majin Buu, when the Earth has become peaceful once again. The voice of Goku, Gohan, and Goten, Masako Nozawa commented on the new anime, saying, \"We've always used the word 'chō' (Super) with Dragon Ball in commercials, games and the like, but the fact that the series titled Dragon Ball Super is beginning is the best thing ever.\"",
      "start_date": "2015-07-05",
      "end_date": null,
      "genre": "adventure",
      "country": "JP",
      "network": "Fuji TV",
      "status": "Ended",
      "image_thumbnail_path": "https://static.episodate.com/images/tv-show/thumbnail/47145."
    },
    {
      "id": 46778,
      "name": "Stranger Things",
      "permalink": "montauk",
      "description": "A love letter to the '80s classics that captivated a generation, <b>Stranger Things</b> is set in 1983 Indiana, where a young boy vanishes into thin air. As friends, family and local police search for answers, they are drawn into an extraordinary mystery involving top-secret government experiments, terrifying supernatural forces and one very strange little girl.",
      "start_date": "2016-07-15",
      "end_date": null,
      "genre": "adventure",
      "country": "US",
      "network": "Netflix",
      "status": "Running",
      "image_thumbnail_path": "https://static.episodate.com/images/tv-show/thumbnail/46778.jpg"
    },
    {
      "id": 33514,
      "name": "The 100",
      "permalink": "the-100",
      "description": "The series is set 97 years after a devastating nuclear war wiped out almost all life on Earth. The only known survivors are the residents of twelve space stations in Earth's orbit prior to the war. The space stations banded together to form a single massive station named \"The Ark\", where about 2,400 people live under the leadership of Chancellor Jaha. Resources are scarce and all crimes, no matter their nature or severity, are punishable by ejection into space (\"floating\") unless the perpetrator is under 18 years of age. After the Ark's life-support systems are found to be critically failing, 100 juvenile prisoners are declared \"expendable\" and sent to the surface—nearby former Washington, D.C.—in a last ditch attempt to determine if Earth is habitable again in a program called \"The 100\", for which the show is named. The teens arrive on a seemingly pristine planet they have only seen from space. They are meant to find refuge and supplies at the old military installation, Mount Weather Emergency Operations Center, located at the Blue Ridge Mountains. However, they have landed a fair distance from it and soon face other problems. Confronting both the wonders and the dangers of this rugged new world, they struggle to form a tentative community. However, they discover not all humanity was wiped out; some people on Earth, called Grounders, survived the war, and there are even more dangers lurking – Reapers (Grounders who have become cannibals) and Mountain Men (who live in Mount Weather, the original destination of the 100).",
      "start_date": "2014-03-19",
      "end_date": null,
      "genre": "drama",
      "country": "US",
      "network": "The CW",
      "status": "Running",
      "image_thumbnail_path": "https://static.episodate.com/images/tv-show/thumbnail/33514.jpg"
    },
    {
      "id": 5348,
      "name": "Supernatural",
      "permalink": "supernatural",
      "description": "Supernatural is an American fantasy horror television series created by Eric Kripke. It was first broadcast on September 13, 2005, on The WB and subsequently became part of successor The CW's lineup. Starring Jared Padalecki as Sam Winchester and Jensen Ackles as Dean Winchester, the series follows the two brothers as they hunt demons, ghosts, monsters, and other supernatural beings in the world. The series is produced by Warner Bros. Television, in association with Wonderland Sound and Vision. Along with Kripke, executive producers have been McG, Robert Singer, Phil Sgriccia, Sera Gamble, Jeremy Carver, John Shiban, Ben Edlund and Adam Glass. Former executive producer and director Kim Manners died of lung cancer during production of the fourth season.<br>The series is filmed in Vancouver, British Columbia and surrounding areas and was in development for nearly ten years, as creator Kripke spent several years unsuccessfully pitching it. The pilot was viewed by an estimated 5.69 million viewers, and the ratings of the first four episodes prompted The WB to pick up the series for a full season. Originally, Kripke planned the series for three seasons but later expanded it to five. The fifth season concluded the series' main storyline, and Kripke departed the series as showrunner. The series has continued on for several more seasons with Sera Gamble and Jeremy Carver assuming the role of showrunner.",
      "start_date": "2005-09-13",
      "end_date": null,
      "genre": "drama",
      "country": "US",
      "network": "The CW",
      "status": "Running",
      "image_thumbnail_path": "https://static.episodate.com/images/tv-show/thumbnail/5348.jpg"
    },
    {
      "id": 22410,
      "name": "Sherlock",
      "permalink": "sherlock",
      "description": "Sherlock depicts \"consulting detective\" Sherlock Holmes (Benedict Cumberbatch) solving various mysteries in London. Holmes is assisted by his flatmate and friend, Dr. John Watson (Martin Freeman), who has returned from military service in Afghanistan with the Royal Army Medical Corps. Although Metropolitan Police Service Detective Inspector Greg Lestrade (Rupert Graves) and others are at first skeptical of Holmes, over time his remarkable intellect and powers of observation persuade them of his value. In part through Watson's blog documenting their adventures, Holmes becomes a reluctant celebrity with the press reporting on his cases and eccentric personal life. Both ordinary people and the British government ask for his help.\r\n<br><br>\r\nAlthough the series depicts a variety of crimes and perpetrators, Holmes' conflict with archnemesis Jim Moriarty (Andrew Scott) is a recurring feature. Molly Hooper (Louise Brealey), a pathologist at St. Bart's Hospital occasionally assists Holmes in his cases. Other recurring roles include Una Stubbs as Mrs Hudson, Holmes and Watson's landlady, and series co-creator Mark Gatiss as Holmes' elder brother Mycroft.",
      "start_date": "2010-07-25",
      "end_date": null,
      "genre": "drama",
      "country": "UK",
      "network": "BBC One",
      "status": "To Be Determined",
      "image_thumbnail_path": "https://static.episodate.com/images/tv-show/thumbnail/22410.jpg"
    }
  ]
}